# Agenda

1. Creating a new data frame
    - Manually
    - From CSV and other files
2. Methods to run on a data frame
3. `.loc` and `.iloc`
4. `nan` and other values in data frames
5. Mask/boolean index

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
s = Series([10, 20, 30, 40, 50])
s

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
df = DataFrame([[10, 20, 30],
               [40, 50, 60],
               [70, 80, 90],
               [100, 110, 120]])
df

     0    1    2
0   10   20   30
1   40   50   60
2   70   80   90
3  100  110  120

In [4]:
df.dtypes

0    int64
1    int64
2    int64
dtype: object

In [5]:
df = DataFrame([[10, 20, 30],
               [40, 50.5, 60],
               [70, 80, 90],
               [100, 110, 120]])
df

     0      1    2
0   10   20.0   30
1   40   50.5   60
2   70   80.0   90
3  100  110.0  120

In [6]:
df.dtypes

0      int64
1    float64
2      int64
dtype: object

In [7]:
df = DataFrame([[10, 20, 30],
               [40, 50, 60],
               [70, 80, 90],
               [100, 110, 120]],
              index=list('abcd'),
              columns=list('xyz'))
df

     x    y    z
a   10   20   30
b   40   50   60
c   70   80   90
d  100  110  120

In [8]:
df.loc['a']

x    10
y    20
z    30
Name: a, dtype: int64

In [9]:
df.iloc[2]

x    70
y    80
z    90
Name: c, dtype: int64

In [10]:
df.loc[['a', 'c']]

    x   y   z
a  10  20  30
c  70  80  90

In [11]:
df.loc['a':'c']

    x   y   z
a  10  20  30
b  40  50  60
c  70  80  90

In [12]:
# for columns, just use []

df['x']

a     10
b     40
c     70
d    100
Name: x, dtype: int64

In [13]:
df.x

a     10
b     40
c     70
d    100
Name: x, dtype: int64

In [14]:
df.x.a

np.int64(10)

In [15]:
df.q

AttributeError: 'DataFrame' object has no attribute 'q'

In [16]:
df

     x    y    z
a   10   20   30
b   40   50   60
c   70   80   90
d  100  110  120

In [17]:
df[['x', 'y']]

     x    y
a   10   20
b   40   50
c   70   80
d  100  110

In [18]:
df

     x    y    z
a   10   20   30
b   40   50   60
c   70   80   90
d  100  110  120

In [19]:
df['x'].mean()

np.float64(55.0)

In [20]:
df['x'].std()

np.float64(38.72983346207417)

In [21]:
df.mean()

x    55.0
y    65.0
z    75.0
dtype: float64

In [22]:
df.std()

x    38.729833
y    38.729833
z    38.729833
dtype: float64

In [23]:
df['x'].describe()

count      4.000000
mean      55.000000
std       38.729833
min       10.000000
25%       32.500000
50%       55.000000
75%       77.500000
max      100.000000
Name: x, dtype: float64

In [24]:
df.describe()

                x           y           z
count    4.000000    4.000000    4.000000
mean    55.000000   65.000000   75.000000
std     38.729833   38.729833   38.729833
min     10.000000   20.000000   30.000000
25%     32.500000   42.500000   52.500000
50%     55.000000   65.000000   75.000000
75%     77.500000   87.500000   97.500000
max    100.000000  110.000000  120.000000

In [25]:
df['s'] = 'this is a test'.split()
df

     x    y    z     s
a   10   20   30  this
b   40   50   60    is
c   70   80   90     a
d  100  110  120  test

In [26]:
df.dtypes

x     int64
y     int64
z     int64
s    object
dtype: object

In [27]:
df.describe()

                x           y           z
count    4.000000    4.000000    4.000000
mean    55.000000   65.000000   75.000000
std     38.729833   38.729833   38.729833
min     10.000000   20.000000   30.000000
25%     32.500000   42.500000   52.500000
50%     55.000000   65.000000   75.000000
75%     77.500000   87.500000   97.500000
max    100.000000  110.000000  120.000000

In [29]:
df['s'].describe()

count        4
unique       4
top       this
freq         1
Name: s, dtype: object

In [30]:
df.describe(include='all')

                 x           y           z     s
count     4.000000    4.000000    4.000000     4
unique         NaN         NaN         NaN     4
top            NaN         NaN         NaN  this
freq           NaN         NaN         NaN     1
mean     55.000000   65.000000   75.000000   NaN
std      38.729833   38.729833   38.729833   NaN
min      10.000000   20.000000   30.000000   NaN
25%      32.500000   42.500000   52.500000   NaN
50%      55.000000   65.000000   75.000000   NaN
75%      77.500000   87.500000   97.500000   NaN
max     100.000000  110.000000  120.000000   NaN

In [31]:
df

     x    y    z     s
a   10   20   30  this
b   40   50   60    is
c   70   80   90     a
d  100  110  120  test

In [33]:
df['x'] > df['x'].mean()

a    False
b    False
c     True
d     True
Name: x, dtype: bool

In [34]:
# I want the valuers in x
# where x is bigger than the mean

df['x'].loc[   df['x'] > df['x'].mean()  ]

c     70
d    100
Name: x, dtype: int64

In [35]:
# I want the values in y
# where x is bigger than the mean of x

df['y'].loc[   df['x'] > df['x'].mean()  ]

c     80
d    110
Name: y, dtype: int64

In [37]:
# I want all of the rows in df
# where x is bigger than the mean of x

df.loc[   df['x'] > df['x'].mean()  ]

     x    y    z     s
c   70   80   90     a
d  100  110  120  test

In [38]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [39]:
df.index = ['first', 'second', 'third', 'fourth']
df

          x    y    z     s
first    10   20   30  this
second   40   50   60    is
third    70   80   90     a
fourth  100  110  120  test

In [40]:

df.columns = list('tuvw')
df

          t    u    v     w
first    10   20   30  this
second   40   50   60    is
third    70   80   90     a
fourth  100  110  120  test

In [41]:
df.dtypes

t     int64
u     int64
v     int64
w    object
dtype: object

In [42]:
df

          t    u    v     w
first    10   20   30  this
second   40   50   60    is
third    70   80   90     a
fourth  100  110  120  test

In [43]:
df['t'].loc[  df['t'] > df['t'].mean()] = 999
df

/var/folders/n7/3xckdj8j3dz45qz4xnlk1fy40000gn/T/ipykernel_1361/2093356721.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['t'].loc[  df['t'] > df['t'].mean()] = 999

          t    u    v     w
first    10   20   30  this
second   40   50   60    is
third   999   80   90     a
fourth  999  110  120  test

In [44]:
df.loc[ df['t'] < df['t'].mean()] = 888
df

          t    u    v     w
first   888  888  888   888
second  888  888  888   888
third   999   80   90     a
fourth  999  110  120  test

In [46]:
df = DataFrame([[10, 20, 30],
               [40, 50, 60],
               [70, 80, 90],
               [100, 110, 120]],
              index=list('abcd'),
              columns=list('xyz'))
df

     x    y    z
a   10   20   30
b   40   50   60
c   70   80   90
d  100  110  120

In [48]:
df.loc[ df['x'] < df['x'].mean() ] = [1,2,3]

In [49]:
df

     x    y    z
a    1    2    3
b    1    2    3
c   70   80   90
d  100  110  120

In [50]:
df = DataFrame([[10, 20, 30],
               [40, 50, 60],
               [70, 80, 90],
               [100, 110, 120]],
              index=list('abcd'),
              columns=list('xyz'))
df

     x    y    z
a   10   20   30
b   40   50   60
c   70   80   90
d  100  110  120

In [51]:
df.loc[ df['x'] < df['x'].mean() ] = [[1,2,3],[4,5,6]]

In [52]:
df

     x    y    z
a    1    2    3
b    4    5    6
c   70   80   90
d  100  110  120

In [53]:
np.random.seed(0)
np.random.randint(0, 100, 10)

array([44, 47, 64, 67, 67,  9, 83, 21, 36, 87])

In [54]:
np.random.randint(0, 100, [3, 4])

array([[70, 88, 88, 12],
       [58, 65, 39, 87],
       [46, 88, 81, 37]])

# Exercise: Data frames

1. Define a data frame with random integers from 0-1,000, with 5 rows and 4 columns. Name the rows a-e, and the columns w-z.
2. Give the mean and std for both columns w and y.
3. Give the mean, std, and max for rows b, d, and e.
4. Show all rows where y is bigger than the mean of z.

In [58]:
df.loc[ df['x'] > df['x'].mean()  ]

     x    y    z
c   70   80   90
d  100  110  120

In [63]:
df['x'] > df['x'].mean()

a    False
b    False
c     True
d     True
Name: x, dtype: bool

In [64]:
# 1. Define a data frame with random integers from 0-1,000, with 5 rows and 4 columns. 
# Name the rows a-e, and the columns w-z.

np.random.seed(0)
df = DataFrame(np.random.randint(0, 1000, [5, 4]),
              index=list('abcde'),
              columns=list('wxyz'))
df

     w    x    y    z
a  684  559  629  192
b  835  763  707  359
c    9  723  277  754
d  804  599   70  472
e  600  396  314  705

In [65]:
# 2. Give the mean and std for both columns w and y.

df['w'].mean()

np.float64(586.4)

In [66]:
df['y'].mean()

np.float64(399.4)

In [70]:
df[['w', 'y']].mean()

w    586.4
y    399.4
dtype: float64

In [71]:
df[['w', 'y']].std()

w    336.248866
y    263.682195
dtype: float64

In [74]:
(
    df[['w', 'y']]
    .describe()
    .loc[['mean', 'std']]
)

               w           y
mean  586.400000  399.400000
std   336.248866  263.682195

In [75]:
df[['w', 'y']].agg(['mean', 'std'])

               w           y
mean  586.400000  399.400000
std   336.248866  263.682195

In [77]:
# 3. Give the mean, std, and max for rows b, d, and e.

df.loc[['b', 'd', 'e']].agg(['mean', 'std', 'max'])

               w           x           y           z
mean  746.333333  586.000000  363.666667  512.000000
std   127.672759  183.845043  321.391247  176.434124
max   835.000000  763.000000  707.000000  705.000000

In [79]:
df.loc[['b', 'd', 'e']].agg(['mean', 'std', 'max'], axis='columns')

     mean         std    max
b  666.00  211.266025  835.0
d  486.25  309.378274  804.0
e  503.75  180.167283  705.0

In [81]:
df.loc[['b', 'd', 'e']]. transpose().agg(['mean', 'std', 'max'])

               b           d           e
mean  666.000000  486.250000  503.750000
std   211.266025  309.378274  180.167283
max   835.000000  804.000000  705.000000

In [83]:
df.loc[['b', 'd', 'e']].T.agg(['mean', 'std', 'max'])

               b           d           e
mean  666.000000  486.250000  503.750000
std   211.266025  309.378274  180.167283
max   835.000000  804.000000  705.000000

In [85]:
# 4. Show all rows where y is bigger than the mean of z.

df.loc[ df['y'] > df['z'].mean() ]

     w    x    y    z
a  684  559  629  192
b  835  763  707  359

In [88]:
df[   df['y'] > 500  ]

a     True
b     True
c    False
d    False
e    False
Name: y, dtype: bool

In [91]:
df['b':'d']

     w    x    y    z
b  835  763  707  359
c    9  723  277  754
d  804  599   70  472

In [87]:
# download from : https://files.lerner.co.il/data-science-exercise-files.zip

In [92]:
# CSV
# comma-separated values
# character-separated values

df = pd.read_csv('taxi.csv')

In [93]:
df.head()

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,2,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,-73.954430,40.764141,1,N,-73.974754,40.754093,2,17.0,0.0,0.5,0.00,0.0,0.3,17.80
1,2,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,-73.971443,40.758942,1,N,-73.978539,40.761909,1,6.5,0.0,0.5,1.00,0.0,0.3,8.30
2,2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,-73.978111,40.738434,1,N,-73.990273,40.745438,1,8.0,0.0,0.5,2.20,0.0,0.3,11.00
3,2,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,-73.945892,40.773529,1,N,-73.971527,40.760330,1,13.5,0.0,0.5,2.86,0.0,0.3,17.16
4,1,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,-73.979088,40.776772,1,N,-73.982162,40.758999,2,9.5,0.0,0.5,0.00,0.0,0.3,10.30

In [94]:
!head taxi.csv

VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
2,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,-73.954429626464844,40.764141082763672,1,N,-73.974754333496094,40.754093170166016,2,17,0,0.5,0,0,0.3,17.8
2,2015-06-02 11:19:30,2015-06-02 11:27:56,1,.46,-73.971443176269531,40.758941650390625,1,N,-73.978538513183594,40.761909484863281,1,6.5,0,0.5,1,0,0.3,8.3
2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,.87,-73.978111267089844,40.738433837890625,1,N,-73.990272521972656,40.745437622070313,1,8,0,0.5,2.2,0,0.3,11
2,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,-73.945892333984375,40.773529052734375,1,N,-73.971527099609375,40.760330200195312,1,13.5,0,0.5,2.86,0,0.3,17.16
1,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,-73.979087829589844,40.776771545410156,1,N,-73.982162475585937,40.758998870849609,2,9.5,0,0.5,0,0,0.3,10.3
1,2015-06-02 11:19:33,2015-06-02 11:28:48,1,1.40,-73.94464111328125,40.779464721679688,1,N,-73.96136474609375,40.771560668945313,1,8,0,0.5,1.75,0,0.3,10.55
1,2015-06-02 11:19:34,2015-06-02 11:38:46,1,1.80,-73.992866516113281,40.748210906982422,1,N,-73.969772338867187,40.748458862304687,1,12.5,0,0.5,3,0,0.3,16.3
1,2015-06-02 11:19:35,2015-06-02 12:36:46,4,11.90,-73.863075256347656,40.769252777099609,1,N,-73.986709594726563,40.761306762695313,1,52.5,0,0.5,15,5.54,0.3,73.84
2,2015-06-02 11:19:36,2015-06-02 11:45:19,1,1.27,-73.991432189941406,40.749305725097656,1,N,-73.985061645507813,40.759525299072266,2,15,0,0.5,0,0,0.3,15.8

In [95]:
df.dtypes

VendorID                   int64
tpep_pickup_datetime      object
tpep_dropoff_datetime     object
passenger_count            int64
trip_distance            float64
pickup_longitude         float64
pickup_latitude          float64
RateCodeID                 int64
store_and_fwd_flag        object
dropoff_longitude        float64
dropoff_latitude         float64
payment_type               int64
fare_amount              float64
extra                    float64
mta_tax                  float64
tip_amount               float64
tolls_amount             float64
improvement_surcharge    float64
total_amount             float64
dtype: object

In [96]:
help(pd.read_csv)

Help on function read_csv in module pandas.io.parsers.readers:

read_csv(
    filepath_or_buffer: FilePath | ReadCsvBuffer[bytes] | ReadCsvBuffer[str],
    *,
    sep: str | None | lib.NoDefault = <no_default>,
    delimiter: str | None | lib.NoDefault = None,
    header: int | Sequence[int] | None | Literal['infer'] = 'infer',
    names: Sequence[Hashable] | None | lib.NoDefault = <no_default>,
    index_col: IndexLabel | Literal[False] | None = None,
    usecols: UsecolsArgType = None,
    dtype: DtypeArg | None = None,
    engine: CSVEngine | None = None,
    converters: Mapping[Hashable, Callable] | None = None,
    true_values: list | None = None,
    false_values: list | None = None,
    skipinitialspace: bool = False,
    skiprows: list[int] | int | Callable[[Hashable], bool] | None = None,
    skipfooter: int = 0,
    nrows: int | None = None,
    na_values: Hashable | Iterable[Hashable] | Mapping[Hashable, Iterable[Hashable]] | None = None,
    keep_default_na: bool = True,
    na_filter: bool = True,
    verbose: bool | lib.NoDefault = <no_default>,
    skip_blank_lines: bool = True,
    parse_dates: bool | Sequence[Hashable] | None = None,
    infer_datetime_format: bool | lib.NoDefault = <no_default>,
    keep_date_col: bool | lib.NoDefault = <no_default>,
    date_parser: Callable | lib.NoDefault = <no_default>,
    date_format: str | dict[Hashable, str] | None = None,
    dayfirst: bool = False,
    cache_dates: bool = True,
    iterator: bool = False,
    chunksize: int | None = None,
    compression: CompressionOptions = 'infer',
    thousands: str | None = None,
    decimal: str = '.',
    lineterminator: str | None = None,
    quotechar: str = '"',
    quoting: int = 0,
    doublequote: bool = True,
    escapechar: str | None = None,
    comment: str | None = None,
    encoding: str | None = None,
    encoding_errors: str | None = 'strict',
    dialect: str | csv.Dialect | None = None,
    on_bad_lines: str = 'error',
    delim_whitespace: bool | lib.NoDefault = <no_default>,
    low_memory: bool = True,
    memory_map: bool = False,
    float_precision: Literal['high', 'legacy'] | None = None,
    storage_options: StorageOptions | None = None,
    dtype_backend: DtypeBackend | lib.NoDefault = <no_default>
) -> DataFrame | TextFileReader
    Read a comma-separated values (csv) file into DataFrame.

    Also supports optionally iterating or breaking of the file
    into chunks.

    Additional help can be found in the online docs for
    `IO Tools <https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html>`_.

    Parameters
    ----------
    filepath_or_buffer : str, path object or file-like object
        Any valid string path is acceptable. The string could be a URL. Valid
        URL schemes include http, ftp, s3, gs, and file. For file URLs, a host is
        expected. A local file could be: file://localhost/path/to/table.csv.

        If you want to pass in a path object, pandas accepts any ``os.PathLike``.

        By file-like object, we refer to objects with a ``read()`` method, such as
        a file handle (e.g. via builtin ``open`` function) or ``StringIO``.
    sep : str, default ','
        Character or regex pattern to treat as the delimiter. If ``sep=None``, the
        C engine cannot automatically detect
        the separator, but the Python parsing engine can, meaning the latter will
        be used and automatically detect the separator from only the first valid
        row of the file by Python's builtin sniffer tool, ``csv.Sniffer``.
        In addition, separators longer than 1 character and different from
        ``'\s+'`` will be interpreted as regular expressions and will also force
        the use of the Python parsing engine. Note that regex delimiters are prone
        to ignoring quoted data. Regex example: ``'\r\t'``.
    delimiter : str, optional
        Alias for ``sep``.
    header : int, Sequence of int, 'infer' or None, default 'infer'
        Row number(s) containing column labels and marking the start of the
        data (zero-indexed). Default behavior is to infer the column names: if no ``names``
        are passed the behavior is identical to ``header=0`` and column
        names are inferred from the first line of the file, if column
        names are passed explicitly to ``names`` then the behavior is identical to
        ``header=None``. Explicitly pass ``header=0`` to be able to
        replace existing names. The header can be a list of integers that
        specify row locations for a :class:`~pandas.MultiIndex` on the columns
        e.g. ``[0, 1, 3]``. Intervening rows that are not specified will be
        skipped (e.g. 2 in this example is skipped). Note that this
        parameter ignores commented lines and empty lines if
        ``skip_blank_lines=True``, so ``header=0`` denotes the first line of
        data rather than the first line of the file.
    names : Sequence of Hashable, optional
        Sequence of column labels to apply. If the file contains a header row,
        then you should explicitly pass ``header=0`` to override the column names.
        Duplicates in this list are not allowed.
    index_col : Hashable, Sequence of Hashable or False, optional
      Column(s) to use as row label(s), denoted either by column labels or column
      indices.  If a sequence of labels or indices is given, :class:`~pandas.MultiIndex`
      will be formed for the row labels.

      Note: ``index_col=False`` can be used to force pandas to *not* use the first
      column as the index, e.g., when you have a malformed file with delimiters at
      the end of each line.
    usecols : Sequence of Hashable or Callable, optional
        Subset of columns to select, denoted either by column labels or column indices.
        If list-like, all elements must either
        be positional (i.e. integer indices into the document columns) or strings
        that correspond to column names provided either by the user in ``names`` or
        inferred from the document header row(s). If ``names`` are given, the document
        header row(s) are not taken into account. For example, a valid list-like
        ``usecols`` parameter would be ``[0, 1, 2]`` or ``['foo', 'bar', 'baz']``.
        Element order is ignored, so ``usecols=[0, 1]`` is the same as ``[1, 0]``.
        To instantiate a :class:`~pandas.DataFrame` from ``data`` with element order
        preserved use ``pd.read_csv(data, usecols=['foo', 'bar'])[['foo', 'bar']]``
        for columns in ``['foo', 'bar']`` order or
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['bar', 'foo']]``
        for ``['bar', 'foo']`` order.

        If callable, the callable function will be evaluated against the column
        names, returning names where the callable function evaluates to ``True``. An
        example of a valid callable argument would be ``lambda x: x.upper() in
        ['AAA', 'BBB', 'DDD']``. Using this parameter results in much faster
        parsing time and lower memory usage.
    dtype : dtype or dict of {Hashable : dtype}, optional
        Data type(s) to apply to either the whole dataset or individual columns.
        E.g., ``{'a': np.float64, 'b': np.int32, 'c': 'Int64'}``
        Use ``str`` or ``object`` together with suitable ``na_values`` settings
        to preserve and not interpret ``dtype``.
        If ``converters`` are specified, they will be applied INSTEAD
        of ``dtype`` conversion.

        .. versionadded:: 1.5.0

            Support for ``defaultdict`` was added. Specify a ``defaultdict`` as input where
            the default determines the ``dtype`` of the columns which are not explicitly
            listed.
    engine : {'c', 'python', 'pyarrow'}, optional
        Parser engine to use. The C and pyarrow engines are faster, while the python engine
        is currently more feature-complete. Multithreading is currently only supported by
        the pyarrow engine.

        .. versionadded:: 1.4.0

            The 'pyarrow' engine was added as an *experimental* engine, and some features
            are unsupported, or may not work correctly, with this engine.
    converters : dict of {Hashable : Callable}, optional
        Functions for converting values in specified columns. Keys can either
        be column labels or column indices.
    true_values : list, optional
        Values to consider as ``True`` in addition to case-insensitive variants of 'True'.
    false_values : list, optional
        Values to consider as ``False`` in addition to case-insensitive variants of 'False'.
    skipinitialspace : bool, default False
        Skip spaces after delimiter.
    skiprows : int, list of int or Callable, optional
        Line numbers to skip (0-indexed) or number of lines to skip (``int``)
        at the start of the file.

        If callable, the callable function will be evaluated against the row
        indices, returning ``True`` if the row should be skipped and ``False`` otherwise.
        An example of a valid callable argument would be ``lambda x: x in [0, 2]``.
    skipfooter : int, default 0
        Number of lines at bottom of file to skip (Unsupported with ``engine='c'``).
    nrows : int, optional
        Number of rows of file to read. Useful for reading pieces of large files.
    na_values : Hashable, Iterable of Hashable or dict of {Hashable : Iterable}, optional
        Additional strings to recognize as ``NA``/``NaN``. If ``dict`` passed, specific
        per-column ``NA`` values.  By default the following values are interpreted as
        ``NaN``: " ", "#N/A", "#N/A N/A", "#NA", "-1.#IND", "-1.#QNAN", "-NaN", "-nan",
        "1.#IND", "1.#QNAN", "<NA>", "N/A", "NA", "NULL", "NaN", "None",
        "n/a", "nan", "null ".

    keep_default_na : bool, default True
        Whether or not to include the default ``NaN`` values when parsing the data.
        Depending on whether ``na_values`` is passed in, the behavior is as follows:

        * If ``keep_default_na`` is ``True``, and ``na_values`` are specified, ``na_values``
          is appended to the default ``NaN`` values used for parsing.
        * If ``keep_default_na`` is ``True``, and ``na_values`` are not specified, only
          the default ``NaN`` values are used for parsing.
        * If ``keep_default_na`` is ``False``, and ``na_values`` are specified, only
          the ``NaN`` values specified ``na_values`` are used for parsing.
        * If ``keep_default_na`` is ``False``, and ``na_values`` are not specified, no
          strings will be parsed as ``NaN``.

        Note that if ``na_filter`` is passed in as ``False``, the ``keep_default_na`` and
        ``na_values`` parameters will be ignored.
    na_filter : bool, default True
        Detect missing value markers (empty strings and the value of ``na_values``). In
        data without any ``NA`` values, passing ``na_filter=False`` can improve the
        performance of reading a large file.
    verbose : bool, default False
        Indicate number of ``NA`` values placed in non-numeric columns.

        .. deprecated:: 2.2.0
    skip_blank_lines : bool, default True
        If ``True``, skip over blank lines rather than interpreting as ``NaN`` values.
    parse_dates : bool, list of Hashable, list of lists or dict of {Hashable : list}, default False
        The behavior is as follows:

        * ``bool``. If ``True`` -> try parsing the index. Note: Automatically set to
          ``True`` if ``date_format`` or ``date_parser`` arguments have been passed.
        * ``list`` of ``int`` or names. e.g. If ``[1, 2, 3]`` -> try parsing columns 1, 2, 3
          each as a separate date column.
        * ``list`` of ``list``. e.g.  If ``[[1, 3]]`` -> combine columns 1 and 3 and parse
          as a single date column. Values are joined with a space before parsing.
        * ``dict``, e.g. ``{'foo' : [1, 3]}`` -> parse columns 1, 3 as date and call
          result 'foo'. Values are joined with a space before parsing.

        If a column or index cannot be represented as an array of ``datetime``,
        say because of an unparsable value or a mixture of timezones, the column
        or index will be returned unaltered as an ``object`` data type. For
        non-standard ``datetime`` parsing, use :func:`~pandas.to_datetime` after
        :func:`~pandas.read_csv`.

        Note: A fast-path exists for iso8601-formatted dates.
    infer_datetime_format : bool, default False
        If ``True`` and ``parse_dates`` is enabled, pandas will attempt to infer the
        format of the ``datetime`` strings in the columns, and if it can be inferred,
        switch to a faster method of parsing them. In some cases this can increase
        the parsing speed by 5-10x.

        .. deprecated:: 2.0.0
            A strict version of this argument is now the default, passing it has no effect.

    keep_date_col : bool, default False
        If ``True`` and ``parse_dates`` specifies combining multiple columns then
        keep the original columns.
    date_parser : Callable, optional
        Function to use for converting a sequence of string columns to an array of
        ``datetime`` instances. The default uses ``dateutil.parser.parser`` to do the
        conversion. pandas will try to call ``date_parser`` in three different ways,
        advancing to the next if an exception occurs: 1) Pass one or more arrays
        (as defined by ``parse_dates``) as arguments; 2) concatenate (row-wise) the
        string values from the columns defined by ``parse_dates`` into a single array
        and pass that; and 3) call ``date_parser`` once for each row using one or
        more strings (corresponding to the columns defined by ``parse_dates``) as
        arguments.

        .. deprecated:: 2.0.0
           Use ``date_format`` instead, or read in as ``object`` and then apply
           :func:`~pandas.to_datetime` as-needed.
    date_format : str or dict of column -> format, optional
        Format to use for parsing dates when used in conjunction with ``parse_dates``.
        The strftime to parse time, e.g. :const:`"%d/%m/%Y"`. See
        `strftime documentation
        <https://docs.python.org/3/library/datetime.html
        #strftime-and-strptime-behavior>`_ for more information on choices, though
        note that :const:`"%f"` will parse all the way up to nanoseconds.
        You can also pass:

        - "ISO8601", to parse any `ISO8601 <https://en.wikipedia.org/wiki/ISO_8601>`_
            time string (not necessarily in exactly the same format);
        - "mixed", to infer the format for each element individually. This is risky,
            and you should probably use it along with `dayfirst`.

        .. versionadded:: 2.0.0
    dayfirst : bool, default False
        DD/MM format dates, international and European format.
    cache_dates : bool, default True
        If ``True``, use a cache of unique, converted dates to apply the ``datetime``
        conversion. May produce significant speed-up when parsing duplicate
        date strings, especially ones with timezone offsets.

    iterator : bool, default False
        Return ``TextFileReader`` object for iteration or getting chunks with
        ``get_chunk()``.
    chunksize : int, optional
        Number of lines to read from the file per chunk. Passing a value will cause the
        function to return a ``TextFileReader`` object for iteration.
        See the `IO Tools docs
        <https://pandas.pydata.org/pandas-docs/stable/io.html#io-chunking>`_
        for more information on ``iterator`` and ``chunksize``.

    compression : str or dict, default 'infer'
        For on-the-fly decompression of on-disk data. If 'infer' and 'filepath_or_buffer' is
        path-like, then detect compression from the following extensions: '.gz',
        '.bz2', '.zip', '.xz', '.zst', '.tar', '.tar.gz', '.tar.xz' or '.tar.bz2'
        (otherwise no compression).
        If using 'zip' or 'tar', the ZIP file must contain only one data file to be read in.
        Set to ``None`` for no decompression.
        Can also be a dict with key ``'method'`` set
        to one of {``'zip'``, ``'gzip'``, ``'bz2'``, ``'zstd'``, ``'xz'``, ``'tar'``} and
        other key-value pairs are forwarded to
        ``zipfile.ZipFile``, ``gzip.GzipFile``,
        ``bz2.BZ2File``, ``zstandard.ZstdDecompressor``, ``lzma.LZMAFile`` or
        ``tarfile.TarFile``, respectively.
        As an example, the following could be passed for Zstandard decompression using a
        custom compression dictionary:
        ``compression={'method': 'zstd', 'dict_data': my_compression_dict}``.

        .. versionadded:: 1.5.0
            Added support for `.tar` files.

        .. versionchanged:: 1.4.0 Zstandard support.

    thousands : str (length 1), optional
        Character acting as the thousands separator in numerical values.
    decimal : str (length 1), default '.'
        Character to recognize as decimal point (e.g., use ',' for European data).
    lineterminator : str (length 1), optional
        Character used to denote a line break. Only valid with C parser.
    quotechar : str (length 1), optional
        Character used to denote the start and end of a quoted item. Quoted
        items can include the ``delimiter`` and it will be ignored.
    quoting : {0 or csv.QUOTE_MINIMAL, 1 or csv.QUOTE_ALL, 2 or csv.QUOTE_NONNUMERIC, 3 or csv.QUOTE_NONE}, default csv.QUOTE_MINIMAL
        Control field quoting behavior per ``csv.QUOTE_*`` constants. Default is
        ``csv.QUOTE_MINIMAL`` (i.e., 0) which implies that only fields containing special
        characters are quoted (e.g., characters defined in ``quotechar``, ``delimiter``,
        or ``lineterminator``.
    doublequote : bool, default True
       When ``quotechar`` is specified and ``quoting`` is not ``QUOTE_NONE``, indicate
       whether or not to interpret two consecutive ``quotechar`` elements INSIDE a
       field as a single ``quotechar`` element.
    escapechar : str (length 1), optional
        Character used to escape other characters.
    comment : str (length 1), optional
        Character indicating that the remainder of line should not be parsed.
        If found at the beginning
        of a line, the line will be ignored altogether. This parameter must be a
        single character. Like empty lines (as long as ``skip_blank_lines=True``),
        fully commented lines are ignored by the parameter ``header`` but not by
        ``skiprows``. For example, if ``comment='#'``, parsing
        ``#empty\na,b,c\n1,2,3`` with ``header=0`` will result in ``'a,b,c'`` being
        treated as the header.
    encoding : str, optional, default 'utf-8'
        Encoding to use for UTF when reading/writing (ex. ``'utf-8'``). `List of Python
        standard encodings
        <https://docs.python.org/3/library/codecs.html#standard-encodings>`_ .

    encoding_errors : str, optional, default 'strict'
        How encoding errors are treated. `List of possible values
        <https://docs.python.org/3/library/codecs.html#error-handlers>`_ .

        .. versionadded:: 1.3.0

    dialect : str or csv.Dialect, optional
        If provided, this parameter will override values (default or not) for the
        following parameters: ``delimiter``, ``doublequote``, ``escapechar``,
        ``skipinitialspace``, ``quotechar``, and ``quoting``. If it is necessary to
        override values, a ``ParserWarning`` will be issued. See ``csv.Dialect``
        documentation for more details.
    on_bad_lines : {'error', 'warn', 'skip'} or Callable, default 'error'
        Specifies what to do upon encountering a bad line (a line with too many fields).
        Allowed values are :

        - ``'error'``, raise an Exception when a bad line is encountered.
        - ``'warn'``, raise a warning when a bad line is encountered and skip that line.

# Exercise: Taxi data

1. Load the file, `taxi.csv`, into a data frame.
2. In how many trips was the `trip_distance` 0? In these trips, how much did people pay (`total_amount`), on average?
3. In how many trips were there 0 passengers (`passenger_count`)? How much did they pay (`total_amount`), and how far did they drive (`trip_distance`)?

Download from : https://files.lerner.co.il/data-science-exercise-files.zip (3rd link at https://files.lerner.co.il)

In [97]:
df = pd.read_csv('taxi.csv',
                usecols=['trip_distance', 'passenger_count', 'total_amount'])
df

      passenger_count  trip_distance  total_amount
0                   1           1.63         17.80
1                   1           0.46          8.30
2                   1           0.87         11.00
3                   1           2.13         17.16
4                   1           1.40         10.30
...               ...            ...           ...
9994                1           2.70         12.30
9995                1           4.50         20.30
9996                1           5.59         22.30
9997                6           1.54          7.80
9998                1           5.80         26.75

[9999 rows x 3 columns]

In [106]:
# 2. In how many trips was the `trip_distance` 0? In these trips, how much did people 
# pay (`total_amount`), on average?

(
    df['total_amount']
    .loc[df['trip_distance'] == 0]
    .mean()
)

np.float64(31.581940298507465)

In [108]:
# 3. In how many trips were there 0 passengers (`passenger_count`)? How much did they pay (`total_amount`), 
# and how far did they drive (`trip_distance`)?


(
    df[['total_amount', 'trip_distance']]
    .loc[df['passenger_count'] == 0]
    .mean()
)

total_amount     25.57
trip_distance     4.60
dtype: float64

In [109]:
df

      passenger_count  trip_distance  total_amount
0                   1           1.63         17.80
1                   1           0.46          8.30
2                   1           0.87         11.00
3                   1           2.13         17.16
4                   1           1.40         10.30
...               ...            ...           ...
9994                1           2.70         12.30
9995                1           4.50         20.30
9996                1           5.59         22.30
9997                6           1.54          7.80
9998                1           5.80         26.75

[9999 rows x 3 columns]

In [110]:
np.random.seed(0)
df = DataFrame(np.random.randint(0, 1000, [5, 4]),
              index=list('abcde'),
              columns=list('wxyz'))
df

     w    x    y    z
a  684  559  629  192
b  835  763  707  359
c    9  723  277  754
d  804  599   70  472
e  600  396  314  705

In [111]:
df.set_index('x')

       w    y    z
x
559  684  629  192
763  835  707  359
723    9  277  754
599  804   70  472
396  600  314  705

In [112]:
# a column that is the index is *not* visible/callable as a regular column
df.set_index('x')['x']

KeyError: 'x'

In [116]:
(
    df
    .set_index('x')
    ['y'].agg(['max', 'idxmax'])
)

max       707
idxmax    763
Name: y, dtype: int64

In [118]:
df.set_index('x')

       w    y    z
x
559  684  629  192
763  835  707  359
723    9  277  754
599  804   70  472
396  600  314  705

In [119]:
df['name'] = 'Adam Barbara Cliff David Ed'.split()
df

     w    x    y    z     name
a  684  559  629  192     Adam
b  835  763  707  359  Barbara
c    9  723  277  754    Cliff
d  804  599   70  472    David
e  600  396  314  705       Ed

In [120]:
df.set_index('name')

           w    x    y    z
name
Adam     684  559  629  192
Barbara  835  763  707  359
Cliff      9  723  277  754
David    804  599   70  472
Ed       600  396  314  705

In [122]:
# output to CSV with to_csv
df.set_index('name').to_csv('mydata.csv')

In [123]:
!cat mydata.csv

name,w,x,y,z
Adam,684,559,629,192
Barbara,835,763,707,359
Cliff,9,723,277,754
David,804,599,70,472
Ed,600,396,314,705

In [125]:
pd.read_csv('mydata.csv', 
            index_col='name')

           w    x    y    z
name
Adam     684  559  629  192
Barbara  835  763  707  359
Cliff      9  723  277  754
David    804  599   70  472
Ed       600  396  314  705

In [126]:
df.set_index('name').to_csv('mydata.csv', sep='\t')

In [127]:
!head mydata.csv

name	w	x	y	z
Adam	684	559	629	192
Barbara	835	763	707	359
Cliff	9	723	277	754
David	804	599	70	472
Ed	600	396	314	705

In [129]:
pd.read_csv('mydata.csv', index_col='name', sep='\t')

           w    x    y    z
name
Adam     684  559  629  192
Barbara  835  763  707  359
Cliff      9  723  277  754
David    804  599   70  472
Ed       600  396  314  705

In [131]:
pd.read_csv('mydata.csv')

              name\tw\tx\ty\tz
0     Adam\t684\t559\t629\t192
1  Barbara\t835\t763\t707\t359
2      Cliff\t9\t723\t277\t754
3     David\t804\t599\t70\t472
4       Ed\t600\t396\t314\t705

In [133]:
!head -30 /etc/passwd

##
# User Database
#
# Note that this file is consulted directly only when the system is running
# in single-user mode.  At other times this information is provided by
# Open Directory.
#
# See the opendirectoryd(8) man page for additional information about
# Open Directory.
##
nobody:*:-2:-2:Unprivileged User:/var/empty:/usr/bin/false
root:*:0:0:System Administrator:/var/root:/bin/sh
daemon:*:1:1:System Services:/var/root:/usr/bin/false
_uucp:*:4:4:Unix to Unix Copy Protocol:/var/spool/uucp:/usr/sbin/uucico
_taskgated:*:13:13:Task Gate Daemon:/var/empty:/usr/bin/false
_networkd:*:24:24:Network Services:/var/networkd:/usr/bin/false
_installassistant:*:25:25:Install Assistant:/var/empty:/usr/bin/false
_lp:*:26:26:Printing Services:/var/spool/cups:/usr/bin/false
_postfix:*:27:27:Postfix Mail Server:/var/spool/postfix:/usr/bin/false
_scsd:*:31:31:Service Configuration Service:/var/empty:/usr/bin/false
_ces:*:32:32:Certificate Enrollment Service:/var/empty:/usr/bin/false
_appstore:*:33:33:Mac App Store Service:/var/db/appstore:/usr/bin/false
_mcxalr:*:54:54:MCX AppLaunch:/var/empty:/usr/bin/false
_appleevents:*:55:55:AppleEvents Daemon:/var/empty:/usr/bin/false
_geod:*:56:56:Geo Services Daemon:/var/db/geod:/usr/bin/false
_devdocs:*:59:59:Developer Documentation:/var/empty:/usr/bin/false
_sandbox:*:60:60:Seatbelt:/var/empty:/usr/bin/false
_mdnsresponder:*:65:65:mDNSResponder:/var/empty:/usr/bin/false
_ard:*:67:67:Apple Remote Desktop:/var/empty:/usr/bin/false
_www:*:70:70:World Wide Web Server:/Library/WebServer:/usr/bin/false

In [139]:
pd.read_csv('/etc/passwd',
           sep=':',
           comment='#',
           header=None,
           names=['username', 'pw', 'uid', 'gid', 'name', 'homedir', 'shell'],
           index_col='username')

,pw,uid,gid,name,homedir,shell
username,,,,,,
nobody,*,-2,-2,Unprivileged User,/var/empty,/usr/bin/false
root,*,0,0,System Administrator,/var/root,/bin/sh
daemon,*,1,1,System Services,/var/root,/usr/bin/false
_uucp,*,4,4,Unix to Unix Copy Protocol,/var/spool/uucp,/usr/sbin/uucico
_taskgated,*,13,13,Task Gate Daemon,/var/empty,/usr/bin/false
...,...,...,...,...,...,...
_swtransparencyd,*,303,303,Software Transparency Services,/var/db/swtransparencyd,/usr/bin/false
_naturallanguaged,*,304,304,Natural Language Services,/var/db/com.apple.naturallanguaged,/usr/bin/false
_corespeechd,*,306,306,CoreSpeech Services,/var/empty,/usr/bin/false
_diagnosticservicesd,*,307,307,Diagnostic Services,/var/empty,/usr/bin/false
_oahd,*,441,441,OAH Daemon,/var/empty,/usr/bin/false

In [142]:
pd.read_csv('/etc/passwd',
           sep=':',
           comment='#',
           header=5
           )

,_networkd,*,24,24.1,Network Services,/var/networkd,/usr/bin/false
0,_installassistant,*,25,25,Install Assistant,/var/empty,/usr/bin/false
1,_lp,*,26,26,Printing Services,/var/spool/cups,/usr/bin/false
2,_postfix,*,27,27,Postfix Mail Server,/var/spool/postfix,/usr/bin/false
3,_scsd,*,31,31,Service Configuration Service,/var/empty,/usr/bin/false
4,_ces,*,32,32,Certificate Enrollment Service,/var/empty,/usr/bin/false
...,...,...,...,...,...,...,...
119,_swtransparencyd,*,303,303,Software Transparency Services,/var/db/swtransparencyd,/usr/bin/false
120,_naturallanguaged,*,304,304,Natural Language Services,/var/db/com.apple.naturallanguaged,/usr/bin/false
121,_corespeechd,*,306,306,CoreSpeech Services,/var/empty,/usr/bin/false
122,_diagnosticservicesd,*,307,307,Diagnostic Services,/var/empty,/usr/bin/false
123,_oahd,*,441,441,OAH Daemon,/var/empty,/usr/bin/false

In [144]:
url = 'https://fred.stlouisfed.org/graph/fredgraph.csv?bgcolor=%23ebf3fb&chart_type=line&drp=0&fo=open%20sans&graph_bgcolor=%23ffffff&height=450&mode=fred&recession_bars=on&txtcolor=%23444444&ts=12&tts=12&width=1320&nt=0&thu=0&trc=0&show_legend=yes&show_axis_titles=yes&show_tooltip=yes&id=UNRATE&scale=left&cosd=1948-01-01&coed=2025-08-01&line_color=%230073e6&link_values=false&line_style=solid&mark_type=none&mw=3&lw=3&ost=-99999&oet=99999&mma=0&fml=a&fq=Monthly&fam=avg&fgst=lin&fgsnd=2020-02-01&line_index=1&transformation=lin&vintage_date=2025-11-11&revision_date=2025-11-11&nd=1948-01-01'

pd.read_csv(url, index_col='observation_date')

                  UNRATE
observation_date
1948-01-01           3.4
1948-02-01           3.8
1948-03-01           4.0
1948-04-01           3.9
1948-05-01           3.5
...                  ...
2025-04-01           4.2
2025-05-01           4.2
2025-06-01           4.1
2025-07-01           4.2
2025-08-01           4.3

[932 rows x 1 columns]

In [145]:
pd.read_excel('titanic3.xls')

FileNotFoundError: [Errno 2] No such file or directory: 'titanic3.xls'

# `.loc`

1. Give it the name of the index you want